<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Admin Message
    |--------------------------------------------------------------------------
    */
    'service' => [
        'edit' => [
            'home-main' => [
                'image-required' => '이미지를 등록해 주세요.',
                'image-exists' => '존재 하는 이미지가 아닙니다.',
                'product-required' => '상품을 선택해 주세요.',
                'product-exists' => '존재 하지 않은 상품입니다.',
                'status-required' => '게시 상태를 선택해 주세요.',
                'status-exists' => '존재 하지 않은 게시 상태 입니다.',
                'status-in' => '정상 게시 상태 값이 아닙니다.',
                'id-exists' => '데이터가 존재 않지 않습니다.'
            ]
        ]
    ]
];
